Tekla.Structures.ModelInternal.TypeMapper.GetCorrectType(System.Type)
Just returns a ModelObjectEnum of correct type for the given type.
Type: Type of the object
Returns: a ModelObjectEnum of correct type